
{
  "category": "現在時制",
  "sub_category": "現在形",
  "levels": [
    {
      "level": 1,
      "questions": [
        {"question_jp": "私は毎朝パンを食べます。", "answer_en": "I eat bread every morning."},
      {"question_jp": "彼は学校に行きます。", "answer_en": "He goes to school."},
      {"question_jp": "犬が庭で走ります。", "answer_en": "The dog runs in the yard."},
      {"question_jp": "私は水を飲みます。", "answer_en": "I drink water."},
      {"question_jp": "彼女は本を読みます。", "answer_en": "She reads a book."},
      {"question_jp": "私は毎日手紙を書きます。", "answer_en": "I write letters every day."},
      {"question_jp": "猫が木の上に登ります。", "answer_en": "The cat climbs the tree."},
      {"question_jp": "私たちは公園で遊びます。", "answer_en": "We play in the park."},
      {"question_jp": "彼は毎朝ジョギングします。", "answer_en": "He jogs every morning."},
      {"question_jp": "私は毎晩テレビを見ます。", "answer_en": "I watch TV every night."},
      {"question_jp": "鳥が空を飛びます。", "answer_en": "The bird flies in the sky."},
      {"question_jp": "彼女はピアノを弾きます。", "answer_en": "She plays the piano."},
      {"question_jp": "私は毎日歯を磨きます。", "answer_en": "I brush my teeth every day."},
      {"question_jp": "彼は毎週末映画を見ます。", "answer_en": "He watches movies every weekend."},
      {"question_jp": "子供たちは庭で遊びます。", "answer_en": "The children play in the yard."},
      {"question_jp": "私は朝コーヒーを飲みます。", "answer_en": "I drink coffee in the morning."},
      {"question_jp": "彼女は毎日仕事に行きます。", "answer_en": "She goes to work every day."},
      {"question_jp": "犬が骨をかじります。", "answer_en": "The dog chews a bone."},
      {"question_jp": "私は毎晩日記を書きます。", "answer_en": "I write a diary every night."},
      {"question_jp": "彼は毎日新聞を読みます。", "answer_en": "He reads the newspaper every day."},
      {"question_jp": "猫が窓の外を見ます。", "answer_en": "The cat looks out the window."},
      {"question_jp": "私たちは毎週テニスをします。", "answer_en": "We play tennis every week."},
      {"question_jp": "彼女は毎朝散歩します。", "answer_en": "She takes a walk every morning."},
      {"question_jp": "私は毎晩音楽を聴きます。", "answer_en": "I listen to music every night."},
      {"question_jp": "鳥が木に止まります。", "answer_en": "The bird sits on the tree."},
      {"question_jp": "彼は毎朝新聞を読みます。", "answer_en": "He reads the newspaper every morning."},
      {"question_jp": "子供たちは学校で勉強します。", "answer_en": "The children study at school."},
      {"question_jp": "私は昼にサンドイッチを食べます。", "answer_en": "I eat a sandwich at lunch."},
      {"question_jp": "彼女は毎日英語を勉強します。", "answer_en": "She studies English every day."},
      {"question_jp": "犬が庭で遊びます。", "answer_en": "The dog plays in the yard."}
      ]
    },
    {
      "level": 2,
      "questions": [
        {"question_jp": "私は毎朝7時に公園でジョギングをします。", "answer_en": "I jog in the park every morning at 7."},
      {"question_jp": "彼女は毎週土曜日に図書館で本を読みます。", "answer_en": "She reads books in the library every Saturday."},
      {"question_jp": "私は昼休みに会社のカフェでサンドイッチを食べます。", "answer_en": "I eat a sandwich at the company cafe during lunch break."},
      {"question_jp": "彼は毎晩家でピアノを弾きます。", "answer_en": "He plays the piano at home every night."},
      {"question_jp": "私たちは週末に公園でサッカーをします。", "answer_en": "We play soccer in the park on weekends."},
      {"question_jp": "彼女は毎朝駅で新聞を読みます。", "answer_en": "She reads the newspaper at the station every morning."},
      {"question_jp": "私は昼休みにカフェで友達と話します。", "answer_en": "I talk with my friends at a cafe during lunch break."},
      {"question_jp": "彼は毎晩庭で犬と遊びます。", "answer_en": "He plays with the dog in the yard every night."},
      {"question_jp": "私たちは毎週日曜日に映画館で映画を見ます。", "answer_en": "We watch movies at the cinema every Sunday."},
      {"question_jp": "彼女は毎朝家の近くの川で散歩します。", "answer_en": "She takes a walk by the river near her house every morning."},
      {"question_jp": "私は毎晩寝る前に本を読みます。", "answer_en": "I read a book before going to bed every night."},
      {"question_jp": "彼は毎朝公園で犬を散歩させます。", "answer_en": "He walks the dog in the park every morning."},
      {"question_jp": "私たちは昼休みに学校の図書館で勉強します。", "answer_en": "We study in the school library during lunch break."},
      {"question_jp": "彼女は毎週火曜日に料理教室でケーキを作ります。", "answer_en": "She makes cakes at the cooking class every Tuesday."},
      {"question_jp": "私は毎日会社でメールをチェックします。", "answer_en": "I check emails at the office every day."},
      {"question_jp": "彼は昼休みに同僚と公園で話します。", "answer_en": "He talks with colleagues in the park during lunch break."},
      {"question_jp": "私たちは週末に図書館で本を読みます。", "answer_en": "We read books in the library on weekends."},
      {"question_jp": "彼女は毎朝駅で友達に会います。", "answer_en": "She meets her friends at the station every morning."},
      {"question_jp": "私は毎晩日記を書きながら音楽を聴きます。", "answer_en": "I write a diary while listening to music every night."},
      {"question_jp": "彼は毎週金曜日に映画館で映画を見ます。", "answer_en": "He watches movies at the cinema every Friday."},
      {"question_jp": "私たちは昼休みに会社のカフェで休憩します。", "answer_en": "We take a break at the company cafe during lunch."},
      {"question_jp": "彼女は毎朝家の庭で花に水をやります。", "answer_en": "She waters the flowers in her garden every morning."},
      {"question_jp": "私は毎晩寝る前に犬と散歩します。", "answer_en": "I walk the dog before going to bed every night."},
      {"question_jp": "彼は毎週土曜日に公園でサッカーをします。", "answer_en": "He plays soccer in the park every Saturday."},
      {"question_jp": "私たちは毎日会社で会議をします。", "answer_en": "We have meetings at the office every day."},
      {"question_jp": "彼女は毎晩リビングでテレビを見ます。", "answer_en": "She watches TV in the living room every night."},
      {"question_jp": "私は昼休みに近くのカフェで友達とランチを食べます。", "answer_en": "I have lunch with my friends at a nearby cafe during lunch break."},
      {"question_jp": "彼は毎朝駅で新聞を読みます。", "answer_en": "He reads the newspaper at the station every morning."},
      {"question_jp": "私たちは毎週火曜日に図書館で勉強します。", "answer_en": "We study in the library every Tuesday."},
      {"question_jp": "彼女は毎朝家でストレッチをします。", "answer_en": "She does stretches at home every morning."}
      ]
    },
    {
      "level": 3,
      "questions": [
        {"question_jp": "私は毎朝7時に公園でジョギングをして、その後カフェで朝食を取ります。", "answer_en": "I jog in the park every morning at 7 and then have breakfast at a cafe."},
    {"question_jp": "彼女は毎週土曜日に図書館で本を読み、友達と感想を話し合います。", "answer_en": "She reads books in the library every Saturday and discusses them with her friends."},
    {"question_jp": "私は昼休みに会社のカフェでサンドイッチを食べながらニュースを読みます。", "answer_en": "I eat a sandwich at the company cafe during lunch break while reading the news."},
    {"question_jp": "彼は毎晩家でピアノを弾き、妹にレッスンを教えます。", "answer_en": "He plays the piano at home every night and gives lessons to his sister."},
    {"question_jp": "私たちは週末に公園でサッカーをし、終わったら近くのカフェで休憩します。", "answer_en": "We play soccer in the park on weekends and then take a break at a nearby cafe."},
    {"question_jp": "彼女は毎朝駅で新聞を読みながら友達と軽く話をします。", "answer_en": "She reads the newspaper at the station every morning while chatting briefly with her friends."},
    {"question_jp": "私は毎晩寝る前に日記を書きながら音楽を聴き、翌日の予定を確認します。", "answer_en": "I write a diary before going to bed while listening to music and checking the next day's schedule."},
    {"question_jp": "彼は毎週金曜日に映画館で映画を見て、その後カフェで感想を話します。", "answer_en": "He watches movies at the cinema every Friday and then discusses them at a cafe."},
    {"question_jp": "私は昼休みに近くの公園で友達と軽く運動しながら話をします。", "answer_en": "I exercise lightly in the nearby park with friends during lunch break while talking."},
    {"question_jp": "彼女は毎朝家の庭で花に水をやり、その後ヨガをします。", "answer_en": "She waters the flowers in her garden every morning and then does yoga."},
    {"question_jp": "彼は毎朝駅で新聞を読み、会社に行く途中で同僚と挨拶します。", "answer_en": "He reads the newspaper at the station every morning and greets colleagues on the way to work."},
    {"question_jp": "私は週末に近くのカフェで友達と勉強しながらお茶を飲みます。", "answer_en": "I study with friends at a nearby cafe on weekends while drinking tea."},
    {"question_jp": "彼女は毎晩リビングでテレビを見て、家族と感想を話します。", "answer_en": "She watches TV in the living room every night and discusses it with her family."},
    {"question_jp": "私は朝食後に犬を散歩させながらニュースを聞きます。", "answer_en": "I walk the dog after breakfast while listening to the news."},
    {"question_jp": "彼は毎週水曜日にジムで運動し、運動後にシャワーを浴びます。", "answer_en": "He exercises at the gym every Wednesday and takes a shower afterward."},
    {"question_jp": "私は昼休みに公園で本を読み、軽く昼寝をします。", "answer_en": "I read a book in the park during lunch break and take a short nap."},
    {"question_jp": "彼女は毎朝駅でコーヒーを買い、その後仕事に向かいます。", "answer_en": "She buys coffee at the station every morning and then heads to work."},
    {"question_jp": "私は週末に図書館で勉強し、その後友達と映画を見ます。", "answer_en": "I study in the library on weekends and then watch a movie with friends."},
    {"question_jp": "彼は毎晩家で料理を作り、家族と一緒に食事をします。", "answer_en": "He cooks at home every night and eats with his family."},
    {"question_jp": "私は朝の散歩中に近所の人と挨拶を交わします。", "answer_en": "I greet neighbors during my morning walk."},
    {"question_jp": "彼女は毎週金曜日にピアノのレッスンを受け、その後図書館で勉強します。", "answer_en": "She takes piano lessons every Friday and then studies in the library."},
    {"question_jp": "私は毎晩ベランダで星を見ながらリラックスします。", "answer_en": "I relax on the balcony every night while watching the stars."},
    {"question_jp": "彼は昼休みに会社の屋上で軽く運動をしてから戻ります。", "answer_en": "He exercises lightly on the office rooftop during lunch break and then returns."},
    {"question_jp": "私は週末に友達と買い物をし、その後カフェで休憩します。", "answer_en": "I go shopping with friends on weekends and then take a break at a cafe."},
    {"question_jp": "彼女は毎朝庭で花に水をやり、野菜を収穫します。", "answer_en": "She waters the flowers in her garden every morning and harvests vegetables."},
    {"question_jp": "私は昼休みに近くの図書館で本を読みながら軽食を食べます。", "answer_en": "I read a book in the nearby library during lunch break while having a snack."},
    {"question_jp": "彼は毎晩寝る前に日記を書き、翌日の予定を確認します。", "answer_en": "He writes a diary every night before going to bed and checks the next day's schedule."},
    {"question_jp": "私は朝食後に散歩をして、帰宅後にコーヒーを飲みます。", "answer_en": "I take a walk after breakfast and then drink coffee when I return home."},
    {"question_jp": "彼女は毎週火曜日に図書館で勉強し、その後カフェで友達と話します。", "answer_en": "She studies at the library every Tuesday and then talks with friends at a cafe."},
    {"question_jp": "私は毎晩音楽を聴きながら軽くストレッチをします。", "answer_en": "I do light stretches every night while listening to music."}
  ]
    }
  ]
}

