
{
  "category": "現在時制",
  "sub_category": "現在完了進行形",
  "levels": [
    {
      "level": 1,
      "questions": [
        {"question_jp": "私は今朝から勉強し続けています。", "answer_en": "I have been studying since this morning."},
    {"question_jp": "彼はずっと本を読んでいます。", "answer_en": "He has been reading a book."},
    {"question_jp": "私たちは1時間ずっと歩き続けています。", "answer_en": "We have been walking for an hour."},
    {"question_jp": "彼女はずっと歌っています。", "answer_en": "She has been singing."},
    {"question_jp": "私はここで待ち続けています。", "answer_en": "I have been waiting here."},
    {"question_jp": "彼はずっとコンピューターで作業しています。", "answer_en": "He has been working on the computer."},
    {"question_jp": "私たちはずっとゲームをしています。", "answer_en": "We have been playing a game."},
    {"question_jp": "彼女はずっと電話しています。", "answer_en": "She has been talking on the phone."},
    {"question_jp": "私は朝から掃除をし続けています。", "answer_en": "I have been cleaning since the morning."},
    {"question_jp": "彼はずっと車を運転しています。", "answer_en": "He has been driving a car."},
    {"question_jp": "私たちはずっと庭で遊んでいます。", "answer_en": "We have been playing in the garden."},
    {"question_jp": "彼女はずっとピアノを弾いています。", "answer_en": "She has been playing the piano."},
    {"question_jp": "私はずっとこの本を読んでいます。", "answer_en": "I have been reading this book."},
    {"question_jp": "彼はずっとテレビを見ています。", "answer_en": "He has been watching TV."},
    {"question_jp": "私たちはずっと映画を見ています。", "answer_en": "We have been watching a movie."},
    {"question_jp": "彼女はずっと絵を描いています。", "answer_en": "She has been drawing a picture."},
    {"question_jp": "私はずっと音楽を聴いています。", "answer_en": "I have been listening to music."},
    {"question_jp": "彼はずっと新聞を読んでいます。", "answer_en": "He has been reading the newspaper."},
    {"question_jp": "私たちはずっと料理をしています。", "answer_en": "We have been cooking."},
    {"question_jp": "彼女はずっと犬と遊んでいます。", "answer_en": "She has been playing with the dog."},
    {"question_jp": "私はずっと手紙を書いています。", "answer_en": "I have been writing a letter."},
    {"question_jp": "彼はずっと勉強しています。", "answer_en": "He has been studying."},
    {"question_jp": "私たちはずっと写真を撮っています。", "answer_en": "We have been taking pictures."},
    {"question_jp": "彼女はずっとテレビゲームをしています。", "answer_en": "She has been playing video games."},
    {"question_jp": "私はずっと電話で話しています。", "answer_en": "I have been talking on the phone."},
    {"question_jp": "彼はずっと歌を歌っています。", "answer_en": "He has been singing a song."},
    {"question_jp": "私たちはずっと庭を掃除しています。", "answer_en": "We have been cleaning the garden."},
    {"question_jp": "彼女はずっと文章を書いています。", "answer_en": "She has been writing an essay."},
    {"question_jp": "私はずっとゲームをしています。", "answer_en": "I have been playing a game."},
    {"question_jp": "彼はずっと本を読んでいます。", "answer_en": "He has been reading books."}
      ]
    },
    {
      "level": 2,
      "questions": [
        {"question_jp": "私は今朝から図書館で勉強し続けています。", "answer_en": "I have been studying at the library since this morning."},
    {"question_jp": "彼は午後ずっと公園でジョギングをしています。", "answer_en": "He has been jogging in the park all afternoon."},
    {"question_jp": "私たちは1時間ずっと教室でプレゼンの練習をしています。", "answer_en": "We have been practicing our presentation in the classroom for an hour."},
    {"question_jp": "彼女は午前中ずっとカフェで絵を描いています。", "answer_en": "She has been drawing at the cafe all morning."},
    {"question_jp": "私は駅で友達を待ち続けています。", "answer_en": "I have been waiting for my friend at the station."},
    {"question_jp": "彼はオフィスでずっとレポートを作成しています。", "answer_en": "He has been working on the report in the office."},
    {"question_jp": "私たちは庭で30分ずっとサッカーをしています。", "answer_en": "We have been playing soccer in the garden for 30 minutes."},
    {"question_jp": "彼女は部屋でずっとピアノの練習をしています。", "answer_en": "She has been practicing the piano in her room."},
    {"question_jp": "私は朝からずっとこの小説を読んでいます。", "answer_en": "I have been reading this novel since the morning."},
    {"question_jp": "彼はずっとオフィスで電話対応をしています。", "answer_en": "He has been answering calls in the office."},
    {"question_jp": "私たちはビーチで1時間ずっと泳いでいます。", "answer_en": "We have been swimming at the beach for an hour."},
    {"question_jp": "彼女はカフェでずっと友達と話しています。", "answer_en": "She has been talking with her friends at the cafe."},
    {"question_jp": "私は朝からずっと部屋の掃除をしています。", "answer_en": "I have been cleaning my room since the morning."},
    {"question_jp": "彼は道路でずっと車を運転しています。", "answer_en": "He has been driving on the road."},
    {"question_jp": "私たちは学校でずっとゲームをしています。", "answer_en": "We have been playing games at school."},
    {"question_jp": "彼女はずっと公園で犬と遊んでいます。", "answer_en": "She has been playing with her dog in the park."},
    {"question_jp": "私は机でずっと手紙を書いています。", "answer_en": "I have been writing a letter at my desk."},
    {"question_jp": "彼は図書館でずっと勉強しています。", "answer_en": "He has been studying in the library."},
    {"question_jp": "私たちは美術館でずっと写真を撮っています。", "answer_en": "We have been taking pictures at the museum."},
    {"question_jp": "彼女は家でずっとテレビゲームをしています。", "answer_en": "She has been playing video games at home."},
    {"question_jp": "私はカフェでずっと友達と電話で話しています。", "answer_en": "I have been talking on the phone with my friend at the cafe."},
    {"question_jp": "彼はずっと歌を歌いながら歩いています。", "answer_en": "He has been singing while walking."},
    {"question_jp": "私たちは庭でずっと植物に水をやっています。", "answer_en": "We have been watering the plants in the garden."},
    {"question_jp": "彼女は机でずっと文章を書いています。", "answer_en": "She has been writing an essay at her desk."},
    {"question_jp": "私は部屋でずっとゲームをしています。", "answer_en": "I have been playing games in my room."},
    {"question_jp": "彼は図書館でずっと本を読んでいます。", "answer_en": "He has been reading books in the library."},
    {"question_jp": "私たちはカフェでずっと宿題をしています。", "answer_en": "We have been doing our homework at the cafe."},
    {"question_jp": "彼女は駅でずっと友達を待っています。", "answer_en": "She has been waiting for her friend at the station."},
    {"question_jp": "私は庭でずっと犬と遊んでいます。", "answer_en": "I have been playing with the dog in the garden."},
    {"question_jp": "彼は部屋でずっと音楽を聴いています。", "answer_en": "He has been listening to music in his room."},
    {"question_jp": "私たちはリビングでずっとテレビを見ています。", "answer_en": "We have been watching TV in the living room."}
      ]
    },
    {
      "level": 3,
      "questions": [
        {"question_jp": "私は今朝からずっと図書館で英語の勉強をしており、新しい単語を覚え続けています。", "answer_en": "I have been studying English at the library since this morning, continuously learning new words."},
    {"question_jp": "彼は午後ずっと公園でジョギングをしており、体力をつけるために走り続けています。", "answer_en": "He has been jogging in the park all afternoon to improve his stamina."},
    {"question_jp": "私たちは1時間以上教室でプレゼンの練習をしており、先生に指摘された部分を直し続けています。", "answer_en": "We have been practicing our presentation in the classroom for over an hour, correcting the parts pointed out by the teacher."},
    {"question_jp": "彼女は午前中ずっとカフェで絵を描きながら、友達に見せる作品を完成させようとしています。", "answer_en": "She has been drawing at the cafe all morning, trying to finish a piece to show her friends."},
    {"question_jp": "私は駅で友達を待ち続けており、列車の到着をずっと気にしています。", "answer_en": "I have been waiting for my friend at the station, constantly checking the train schedule."},
    {"question_jp": "彼はオフィスでずっとレポートを作成しており、締め切りに間に合わせるために頑張っています。", "answer_en": "He has been working on the report in the office, trying hard to meet the deadline."},
    {"question_jp": "私たちは庭で30分以上サッカーをしており、チームの戦術を確認しながら練習しています。", "answer_en": "We have been playing soccer in the garden for over 30 minutes, practicing while checking our team tactics."},
    {"question_jp": "彼女は部屋でずっとピアノの練習をしており、明日のコンサートに向けて曲を完璧にしようとしています。", "answer_en": "She has been practicing the piano in her room, trying to perfect the pieces for tomorrow's concert."},
    {"question_jp": "私は朝からずっとこの小説を読んでおり、物語の展開に夢中になっています。", "answer_en": "I have been reading this novel since the morning, getting completely absorbed in the story."},
    {"question_jp": "彼はずっとオフィスで電話対応をしており、重要な顧客とのやり取りを続けています。", "answer_en": "He has been answering calls in the office, continuing important conversations with clients."},
    {"question_jp": "私たちはビーチで1時間以上泳いでおり、潮の流れに気をつけながら練習しています。", "answer_en": "We have been swimming at the beach for over an hour, being careful of the currents while practicing."},
    {"question_jp": "彼女はカフェでずっと友達と話し続けており、最近の出来事を詳しく聞いています。", "answer_en": "She has been talking with her friends at the cafe, listening carefully to recent events."},
    {"question_jp": "私は朝からずっと部屋の掃除をしており、来客に備えて家を整えています。", "answer_en": "I have been cleaning my room since the morning, preparing the house for visitors."},
    {"question_jp": "彼は道路でずっと車を運転しており、長距離移動に備えて休憩を取りながら走っています。", "answer_en": "He has been driving on the road, taking breaks while preparing for a long-distance trip."},
    {"question_jp": "私たちは学校でずっとゲームをしており、新しい戦略を試しながら遊んでいます。", "answer_en": "We have been playing games at school, trying new strategies while having fun."},
    {"question_jp": "彼女はずっと公園で犬と遊び続けており、犬の健康を気遣っています。", "answer_en": "She has been playing with her dog in the park, paying attention to the dog's health."},
    {"question_jp": "私は机でずっと手紙を書き続けており、大切な友達に気持ちを伝えようとしています。", "answer_en": "I have been writing a letter at my desk, trying to convey my feelings to an important friend."},
    {"question_jp": "彼は図書館でずっと勉強しており、試験に向けて集中力を維持しています。", "answer_en": "He has been studying in the library, maintaining focus for the exam."},
    {"question_jp": "私たちは美術館でずっと写真を撮り続けており、展示作品を丁寧に記録しています。", "answer_en": "We have been taking pictures at the museum, carefully documenting the exhibits."},
    {"question_jp": "彼女は家でずっとテレビゲームをしており、友達との対戦に集中しています。", "answer_en": "She has been playing video games at home, focusing on competing with her friends."},
    {"question_jp": "私はカフェでずっと友達と電話で話し続けており、旅行の計画を詳細に立てています。", "answer_en": "I have been talking on the phone with my friend at the cafe, planning the trip in detail."},
    {"question_jp": "彼はずっと歌を歌いながら歩き続けており、通行人に楽しさを伝えています。", "answer_en": "He has been singing while walking, sharing his joy with passersby."},
    {"question_jp": "私たちは庭でずっと植物に水をやり続けており、花が元気に育つように世話をしています。", "answer_en": "We have been watering the plants in the garden, taking care so that the flowers grow well."},
    {"question_jp": "彼女は机でずっと文章を書き続けており、新しいアイデアを反映させています。", "answer_en": "She has been writing an essay at her desk, incorporating new ideas as she goes."},
    {"question_jp": "私は部屋でずっとゲームをしており、レベルアップに集中しています。", "answer_en": "I have been playing games in my room, focusing on leveling up."},
    {"question_jp": "彼は図書館でずっと本を読んでおり、情報を整理しながら学んでいます。", "answer_en": "He has been reading books in the library, organizing information as he studies."},
    {"question_jp": "私たちはカフェでずっと宿題をしており、効率よく進める方法を試しています。", "answer_en": "We have been doing our homework at the cafe, trying efficient ways to complete it."},
    {"question_jp": "彼女は駅でずっと友達を待ち続けており、列車の遅延情報を気にしています。", "answer_en": "She has been waiting for her friend at the station, keeping an eye on train delays."},
    {"question_jp": "私は庭でずっと犬と遊び続けており、犬の運動不足を解消しています。", "answer_en": "I have been playing with the dog in the garden, helping it get enough exercise."},
    {"question_jp": "彼は部屋でずっと音楽を聴き続けており、新しいアルバムの曲を覚えています。", "answer_en": "He has been listening to music in his room, memorizing the tracks of a new album."},
    {"question_jp": "私たちはリビングでずっとテレビを見続けており、ニュースを詳細にチェックしています。", "answer_en": "We have been watching TV in the living room, checking the news in detail."}

  ]
    }
  ]
}

