
{
  "category": "現在時制",
  "sub_category": "現在完了形",
  "levels": 
    {
      "1": [{"question_jp": "私はすでに宿題を終えました。", "answer_en": "I have finished my homework."},
        {"question_jp": "彼はその本を読んだことがあります。", "answer_en": "He has read that book."},
        {"question_jp": "私たちはここに来たことがあります。", "answer_en": "We have been here."},
        {"question_jp": "彼女はその映画を見たことがあります。", "answer_en": "She has watched that movie."},
        {"question_jp": "私は昼食をもう食べました。", "answer_en": "I have already eaten lunch."},
        {"question_jp": "彼は新しいゲームを試したことがあります。", "answer_en": "He has tried the new game."},
        {"question_jp": "私たちはこの道を歩いたことがあります。", "answer_en": "We have walked this street."},
        {"question_jp": "彼女はその歌を聞いたことがあります。", "answer_en": "She has heard that song."},
        {"question_jp": "私はその手紙を書き終えました。", "answer_en": "I have written the letter."},
        {"question_jp": "彼は写真を撮ったことがあります。", "answer_en": "He has taken photos."},
        {"question_jp": "私はすでに朝ごはんを食べました。", "answer_en": "I have eaten breakfast already."},
        {"question_jp": "彼女はその映画を見たことがあります。", "answer_en": "She has seen that movie."},
        {"question_jp": "私たちはすでに学校に到着しました。", "answer_en": "We have arrived at school."},
        {"question_jp": "彼は新しい仕事を始めたことがあります。", "answer_en": "He has started a new job."},
        {"question_jp": "私はずっとこの本を読んでいます。", "answer_en": "I have read this book."},
        {"question_jp": "彼女はピアノを弾いたことがあります。", "answer_en": "She has played the piano."},
        {"question_jp": "私たちはその映画館に行ったことがあります。", "answer_en": "We have been to that cinema."},
        {"question_jp": "彼は新しいカフェに行ったことがあります。", "answer_en": "He has visited the new cafe."},
        {"question_jp": "私はその手紙を送ったことがあります。", "answer_en": "I have sent the letter."},
        {"question_jp": "彼女は長い手紙を書いたことがあります。", "answer_en": "She has written a long letter."},
        {"question_jp": "私たちはこの道を何度も歩いたことがあります。", "answer_en": "We have walked this street many times."},
        {"question_jp": "彼はその映画を何度も見たことがあります。", "answer_en": "He has watched that movie many times."},
        {"question_jp": "私は新しいレストランに行ったことがあります。", "answer_en": "I have been to a new restaurant."},
        {"question_jp": "彼女はその本を読んだことがあります。", "answer_en": "She has read that book."},
        {"question_jp": "私たちはその店で買い物をしたことがあります。", "answer_en": "We have shopped at that store."},
        {"question_jp": "彼は海外旅行に行ったことがあります。", "answer_en": "He has traveled abroad."},
        {"question_jp": "私はこの道をずっと歩いてきました。", "answer_en": "I have walked this road."},
        {"question_jp": "彼女は新しい映画を見ました。", "answer_en": "She has seen a new movie."},
        {"question_jp": "私たちはその公園に行ったことがあります。", "answer_en": "We have been to that park."},
        {"question_jp": "彼は新しい本を読み終えました。", "answer_en": "He has finished the new book."}],
      "2": [        {"question_jp": "私は今朝、宿題を終えました。", "answer_en": "I have finished my homework this morning."},
    {"question_jp": "彼は先週、その本を読んだことがあります。", "answer_en": "He has read that book last week."},
    {"question_jp": "私たちはこの町に何度も来たことがあります。", "answer_en": "We have been to this town many times."},
    {"question_jp": "彼女は最近、その映画を見たことがあります。", "answer_en": "She has watched that movie recently."},
    {"question_jp": "私は昼食をもう食べました、図書館で。", "answer_en": "I have already eaten lunch at the library."},
    {"question_jp": "彼は新しいゲームを昨日試したことがあります。", "answer_en": "He has tried the new game yesterday."},
    {"question_jp": "私たちはこの道を毎日歩いたことがあります。", "answer_en": "We have walked this street every day."},
    {"question_jp": "彼女はその歌を先週聞いたことがあります。", "answer_en": "She has heard that song last week."},
    {"question_jp": "私はその手紙を書き終えました、今朝。", "answer_en": "I have written the letter this morning."},
    {"question_jp": "彼は何度も写真を撮ったことがあります、公園で。", "answer_en": "He has taken photos many times at the park."},
    {"question_jp": "私はすでに朝ごはんを食べました、台所で。", "answer_en": "I have eaten breakfast already in the kitchen."},
    {"question_jp": "彼女は最近その映画を見たことがあります。", "answer_en": "She has seen that movie recently."},
    {"question_jp": "私たちはこの学校に何度も来たことがあります。", "answer_en": "We have arrived at this school many times."},
    {"question_jp": "彼は新しい仕事を先週始めたことがあります。", "answer_en": "He has started a new job last week."},
    {"question_jp": "私はこの本を何度も読みました、寝る前に。", "answer_en": "I have read this book many times before going to bed."},
    {"question_jp": "彼女はピアノを今までに弾いたことがあります。", "answer_en": "She has played the piano before."},
    {"question_jp": "私たちはその映画館に最近行ったことがあります。", "answer_en": "We have been to that cinema recently."},
    {"question_jp": "彼は新しいカフェに昨日行ったことがあります。", "answer_en": "He has visited the new cafe yesterday."},
    {"question_jp": "私はその手紙を今までに送ったことがあります。", "answer_en": "I have sent the letter before."},
    {"question_jp": "彼女は長い手紙を書いたことがあります、先週。", "answer_en": "She has written a long letter last week."},
    {"question_jp": "私たちはこの道を何度も歩いたことがあります、毎朝。", "answer_en": "We have walked this street many times every morning."},
    {"question_jp": "彼はその映画を何度も見たことがあります、夜に。", "answer_en": "He has watched that movie many times at night."},
    {"question_jp": "私は新しいレストランに先週行ったことがあります。", "answer_en": "I have been to a new restaurant last week."},
    {"question_jp": "彼女はその本を最近読んだことがあります。", "answer_en": "She has read that book recently."},
    {"question_jp": "私たちはその店で何度も買い物をしたことがあります。", "answer_en": "We have shopped at that store many times."},
    {"question_jp": "彼は海外旅行に先月行ったことがあります。", "answer_en": "He has traveled abroad last month."},
    {"question_jp": "私はこの道をずっと歩いてきました、今朝。", "answer_en": "I have walked this road this morning."},
    {"question_jp": "彼女は新しい映画を最近見ました。", "answer_en": "She has seen a new movie recently."},
    {"question_jp": "私たちはその公園に何度も行ったことがあります。", "answer_en": "We have been to that park many times."},
    {"question_jp": "彼は新しい本を先週読み終えました。", "answer_en": "He has finished the new book last week."}
],
      "3": [{"question_jp": "私はこの街に何度も来たことがあります、仕事で出張するたびに。", "answer_en": "I have been to this town many times whenever I travel for work."},
    {"question_jp": "彼女は最近、その映画を見たことがあります、友達に勧められて。", "answer_en": "She has watched that movie recently, as her friend recommended."},
    {"question_jp": "私たちはこの学校に何度も来たことがあります、特別なイベントがあるときに。", "answer_en": "We have visited this school many times when there are special events."},
    {"question_jp": "彼はその本を何度も読んだことがあります、寝る前に落ち着いて。", "answer_en": "He has read that book many times before going to bed quietly."},
    {"question_jp": "私は今朝、宿題を終えました、カフェで勉強してから。", "answer_en": "I have finished my homework this morning after studying at the cafe."},
    {"question_jp": "彼女はこの歌を何度も聞いたことがあります、仕事中にリラックスするために。", "answer_en": "She has listened to this song many times to relax during work."},
    {"question_jp": "私たちはその映画館に最近行ったことがあります、週末に友達と一緒に。", "answer_en": "We have been to that cinema recently with friends on the weekend."},
    {"question_jp": "彼は新しいカフェに昨日行ったことがあります、通りかかったときに。", "answer_en": "He has visited the new cafe yesterday when passing by."},
    {"question_jp": "私はその手紙を今までに何度も送ったことがあります、重要な情報を伝えるために。", "answer_en": "I have sent that letter many times to convey important information."},
    {"question_jp": "彼女は長い手紙を書いたことがあります、先週、親友に相談してから。", "answer_en": "She has written a long letter last week after consulting her best friend."},
    {"question_jp": "私たちはこの道を何度も歩いたことがあります、毎朝散歩するときに。", "answer_en": "We have walked this street many times during our morning walks."},
    {"question_jp": "彼はその映画を何度も見たことがあります、夜に家でリラックスするときに。", "answer_en": "He has watched that movie many times at night while relaxing at home."},
    {"question_jp": "私は新しいレストランに先週行ったことがあります、友達の誕生日を祝うために。", "answer_en": "I have been to a new restaurant last week to celebrate my friend's birthday."},
    {"question_jp": "彼女はその本を最近読んだことがあります、通勤中に少しずつ。", "answer_en": "She has read that book recently little by little during her commute."},
    {"question_jp": "私たちはその店で何度も買い物をしたことがあります、休日に家族と一緒に。", "answer_en": "We have shopped at that store many times on weekends with our family."},
    {"question_jp": "彼は海外旅行に先月行ったことがあります、ビジネスと観光を兼ねて。", "answer_en": "He has traveled abroad last month for both business and sightseeing."},
    {"question_jp": "私はこの道をずっと歩いてきました、今朝、犬と一緒に。", "answer_en": "I have walked this road this morning with my dog."},
    {"question_jp": "彼女は新しい映画を最近見ました、映画館で一人で静かに。", "answer_en": "She has seen a new movie recently alone quietly at the cinema."},
    {"question_jp": "私たちはその公園に何度も行ったことがあります、季節ごとの花を楽しむために。", "answer_en": "We have been to that park many times to enjoy seasonal flowers."},
    {"question_jp": "彼は新しい本を先週読み終えました、図書館で集中して。", "answer_en": "He has finished the new book last week concentrating in the library."},
    {"question_jp": "私はこの街の美術館に何度も行ったことがあります、特別展があるたびに。", "answer_en": "I have visited art museums in this town many times whenever there is a special exhibition."},
    {"question_jp": "彼女はその歌を何度も歌ったことがあります、カラオケで友達と一緒に。", "answer_en": "She has sung that song many times at karaoke with friends."},
    {"question_jp": "私たちはこのレストランに最近行ったことがあります、夜に美味しいディナーを楽しむために。", "answer_en": "We have been to this restaurant recently to enjoy a delicious dinner at night."},
    {"question_jp": "彼は新しいゲームを先週試したことがあります、友達と競争するために。", "answer_en": "He has tried the new game last week to compete with friends."},
    {"question_jp": "私はその手紙を何度も書いたことがあります、重要な内容を正確に伝えるために。", "answer_en": "I have written that letter many times to convey important information accurately."},
    {"question_jp": "彼女は最近その映画を見ました、友達と一緒にリラックスするために。", "answer_en": "She has watched that movie recently with friends to relax."},
    {"question_jp": "私たちはこの町に何度も来たことがあります、観光地を巡るために。", "answer_en": "We have been to this town many times to visit tourist spots."},
    {"question_jp": "彼はその映画を何度も見たことがあります、週末の夜に家で。", "answer_en": "He has watched that movie many times at home on weekend nights."},
    {"question_jp": "私は新しいカフェに先週行ったことがあります、静かな時間を過ごすために。", "answer_en": "I have visited the new cafe last week to spend some quiet time."}  
]
    }
}

