{
  "category": "現在時制",
  "sub_category": "現在進行形",
  "levels": [
    {
      "level": 1,
      "questions": [
        {"question_jp": "私は今、音楽を聴いています。", "answer_en": "I am listening to music now."},
        {"question_jp": "彼は今、本を読んでいます。", "answer_en": "He is reading a book now."},
        {"question_jp": "彼女は今、料理をしています。", "answer_en": "She is cooking now."},
        {"question_jp": "私たちは今、公園で歩いています。", "answer_en": "We are walking in the park now."},
        {"question_jp": "犬は今、庭で遊んでいます。", "answer_en": "The dog is playing in the garden now."},
        {"question_jp": "彼は今、テレビを見ています。", "answer_en": "He is watching TV now."},
        {"question_jp": "私は今、手紙を書いています。", "answer_en": "I am writing a letter now."},
        {"question_jp": "彼女は今、電話をしています。", "answer_en": "She is talking on the phone now."},
        {"question_jp": "子供たちは今、学校で勉強しています。", "answer_en": "The children are studying at school now."},
        {"question_jp": "私は今、絵を描いています。", "answer_en": "I am drawing a picture now."},
        {"question_jp": "彼は今、宿題をしています。", "answer_en": "He is doing his homework now."},
        {"question_jp": "私たちは今、映画を見ています。", "answer_en": "We are watching a movie now."},
        {"question_jp": "犬は今、散歩しています。", "answer_en": "The dog is walking now."},
        {"question_jp": "彼女は今、ピアノを弾いています。", "answer_en": "She is playing the piano now."},
        {"question_jp": "私は今、部屋を掃除しています。", "answer_en": "I am cleaning the room now."},
        {"question_jp": "彼は今、窓を開けています。", "answer_en": "He is opening the window now."},
        {"question_jp": "子供たちは今、ゲームをしています。", "answer_en": "The children are playing a game now."},
        {"question_jp": "私は今、お茶を飲んでいます。", "answer_en": "I am drinking tea now."},
        {"question_jp": "彼女は今、歌を歌っています。", "answer_en": "She is singing now."},
        {"question_jp": "私は今、パソコンを使っています。", "answer_en": "I am using the computer now."},
        {"question_jp": "彼は今、写真を撮っています。", "answer_en": "He is taking pictures now."},
        {"question_jp": "私たちは今、買い物をしています。", "answer_en": "We are shopping now."},
        {"question_jp": "犬は今、寝ています。", "answer_en": "The dog is sleeping now."},
        {"question_jp": "彼女は今、掃除機をかけています。", "answer_en": "She is vacuuming now."},
        {"question_jp": "私は今、ニュースを読んでいます。", "answer_en": "I am reading the news now."},
        {"question_jp": "彼は今、車を運転しています。", "answer_en": "He is driving a car now."},
        {"question_jp": "私たちは今、写真を撮っています。", "answer_en": "We are taking pictures now."},
        {"question_jp": "彼女は今、勉強しています。", "answer_en": "She is studying now."},
        {"question_jp": "私は今、歌を歌っています。", "answer_en": "I am singing now."},
        {"question_jp": "彼は今、庭で草を刈っています。", "answer_en": "He is mowing the lawn now."}
      ]
    },
    {
      "level": 2,
      "questions": [
        {"question_jp": "私は今、リビングで音楽を聴きながら宿題をしています。", "answer_en": "I am listening to music in the living room while doing my homework now."},
        {"question_jp": "彼は今、駅のカフェで本を読んでいます。", "answer_en": "He is reading a book at the cafe in the station now."},
        {"question_jp": "彼女は今、台所で夕食の準備をしています。", "answer_en": "She is preparing dinner in the kitchen now."},
        {"question_jp": "私たちは今、公園でジョギングをしながら話しています。", "answer_en": "We are jogging in the park while talking now."},
        {"question_jp": "犬は今、庭でボールを追いかけて遊んでいます。", "answer_en": "The dog is chasing the ball in the garden now."},
        {"question_jp": "彼は今、リビングでテレビを見ながらスナックを食べています。", "answer_en": "He is watching TV in the living room while eating a snack now."},
        {"question_jp": "私は今、机で手紙を書きながらコーヒーを飲んでいます。", "answer_en": "I am writing a letter at my desk while drinking coffee now."},
        {"question_jp": "彼女は今、電話で友達と話しながらメモを取っています。", "answer_en": "She is talking on the phone with her friend while taking notes now."},
        {"question_jp": "子供たちは今、教室で英語を学びながらゲームをしています。", "answer_en": "The children are learning English in the classroom while playing a game now."},
        {"question_jp": "私は今、絵を描きながら音楽を聴いています。", "answer_en": "I am drawing a picture while listening to music now."},
        {"question_jp": "彼は今、自分の部屋で宿題をしながらラジオを聞いています。", "answer_en": "He is doing his homework in his room while listening to the radio now."},
        {"question_jp": "私たちは今、映画館で映画を見ながらお菓子を食べています。", "answer_en": "We are watching a movie at the cinema while eating snacks now."},
        {"question_jp": "犬は今、公園で他の犬と遊んでいます。", "answer_en": "The dog is playing with other dogs in the park now."},
        {"question_jp": "彼女は今、ピアノを弾きながら歌を歌っています。", "answer_en": "She is playing the piano while singing now."},
        {"question_jp": "私は今、部屋を掃除しながら音楽を聴いています。", "answer_en": "I am cleaning the room while listening to music now."},
        {"question_jp": "彼は今、窓を開けながら電話で話しています。", "answer_en": "He is opening the window while talking on the phone now."},
        {"question_jp": "子供たちは今、ゲームをしながらおやつを食べています。", "answer_en": "The children are playing a game while having a snack now."},
        {"question_jp": "私は今、お茶を飲みながらニュースを読んでいます。", "answer_en": "I am drinking tea while reading the news now."},
        {"question_jp": "彼女は今、歌を歌いながらダンスの練習をしています。", "answer_en": "She is singing while practicing dance now."},
        {"question_jp": "私は今、パソコンを使いながらメモを取っています。", "answer_en": "I am using the computer while taking notes now."},
        {"question_jp": "彼は今、写真を撮りながら景色を楽しんでいます。", "answer_en": "He is taking pictures while enjoying the scenery now."},
        {"question_jp": "私たちは今、買い物をしながら話をしています。", "answer_en": "We are shopping while talking now."},
        {"question_jp": "犬は今、庭で寝転びながら日向ぼっこしています。", "answer_en": "The dog is lying in the garden while enjoying the sun now."},
        {"question_jp": "彼女は今、掃除機をかけながら音楽を聴いています。", "answer_en": "She is vacuuming while listening to music now."},
        {"question_jp": "私は今、図書館で本を読みながらノートを取っています。", "answer_en": "I am reading a book in the library while taking notes now."},
        {"question_jp": "彼は今、車を運転しながらナビを見ています。", "answer_en": "He is driving a car while looking at the GPS now."},
        {"question_jp": "私たちは今、写真を撮りながら笑っています。", "answer_en": "We are taking pictures while laughing now."},
        {"question_jp": "彼女は今、勉強をしながら音楽を聴いています。", "answer_en": "She is studying while listening to music now."},
        {"question_jp": "私は今、歌を歌いながらギターを弾いています。", "answer_en": "I am singing while playing the guitar now."},
        {"question_jp": "彼は今、庭で草を刈りながら水をやっています。", "answer_en": "He is mowing the lawn while watering the plants now."}
      ]
    },
    {
      "level": 3,
      "questions": [
        {"question_jp": "私は今、リビングで音楽を聴きながら宿題をして、時々ノートを見直しています。", "answer_en": "I am listening to music in the living room while doing my homework and occasionally reviewing my notes now."},
    {"question_jp": "彼は今、駅のカフェで本を読んでいる間に友達にメッセージを送っています。", "answer_en": "He is reading a book at the cafe in the station while sending messages to his friend now."},
    {"question_jp": "彼女は今、台所で夕食を準備しながら電話で話しています。", "answer_en": "She is preparing dinner in the kitchen while talking on the phone now."},
    {"question_jp": "私たちは今、公園でジョギングをしながら空の写真を撮っています。", "answer_en": "We are jogging in the park while taking pictures of the sky now."},
    {"question_jp": "犬は今、庭でボールを追いかけながら鳥を見ています。", "answer_en": "The dog is chasing the ball in the garden while watching birds now."},
    {"question_jp": "彼は今、リビングでテレビを見ながらスナックを食べ、妹に説明しています。", "answer_en": "He is watching TV in the living room while eating a snack and explaining it to his sister now."},
    {"question_jp": "私は今、机で手紙を書きながらコーヒーを飲み、外の景色を楽しんでいます。", "answer_en": "I am writing a letter at my desk while drinking coffee and enjoying the view outside now."},
    {"question_jp": "彼女は今、電話で友達と話しながらメモを取り、後で復習します。", "answer_en": "She is talking on the phone with her friend while taking notes and reviewing them later now."},
    {"question_jp": "子供たちは今、教室で英語を学びながらゲームをし、先生の指示を聞いています。", "answer_en": "The children are learning English in the classroom while playing a game and following the teacher's instructions now."},
    {"question_jp": "私は今、絵を描きながら音楽を聴き、同時にスケッチブックにアイデアを書き留めています。", "answer_en": "I am drawing a picture while listening to music and simultaneously jotting down ideas in my sketchbook now."},
    {"question_jp": "彼は今、庭で草を刈りながら水をやっています。", "answer_en": "He is mowing the lawn while watering the plants now."},
    {"question_jp": "私は今、カフェでコーヒーを飲みながら日記を書いています。", "answer_en": "I am drinking coffee at a cafe while writing my diary now."},
    {"question_jp": "彼女は今、キッチンで料理をしながらラジオを聞いています。", "answer_en": "She is cooking in the kitchen while listening to the radio now."},
    {"question_jp": "私たちは今、図書館で勉強しながら電子辞書を使っています。", "answer_en": "We are studying in the library while using an electronic dictionary now."},
    {"question_jp": "犬は今、庭で遊びながら蝶を追いかけています。", "answer_en": "The dog is playing in the garden while chasing butterflies now."},
    {"question_jp": "彼は今、会議に参加しながらノートパソコンで資料を確認しています。", "answer_en": "He is attending a meeting while checking documents on his laptop now."},
    {"question_jp": "私は今、リビングでテレビを見ながらお菓子を食べています。", "answer_en": "I am watching TV in the living room while eating snacks now."},
    {"question_jp": "彼女は今、ピアノを弾きながら歌詞を書き留めています。", "answer_en": "She is playing the piano while writing down lyrics now."},
    {"question_jp": "私たちは今、外でランニングをしながら話題のニュースを話しています。", "answer_en": "We are running outside while talking about the latest news now."},
    {"question_jp": "子供たちは今、教室で工作をしながら音楽を聴いています。", "answer_en": "The children are doing crafts in the classroom while listening to music now."},
    {"question_jp": "私は今、部屋でストレッチをしながらオンラインレッスンを受けています。", "answer_en": "I am stretching in my room while attending an online lesson now."},
    {"question_jp": "彼は今、庭で花に水をやりながら鳥の写真を撮っています。", "answer_en": "He is watering flowers in the garden while taking pictures of birds now."},
    {"question_jp": "私は今、カフェで友達と話しながらノートにメモを取っています。", "answer_en": "I am talking with my friend at a cafe while taking notes in my notebook now."},
    {"question_jp": "彼女は今、キッチンで朝食を作りながらニュースを聞いています。", "answer_en": "She is making breakfast in the kitchen while listening to the news now."},
    {"question_jp": "私たちは今、公園で散歩しながら植物の写真を撮っています。", "answer_en": "We are walking in the park while taking pictures of plants now."},
    {"question_jp": "犬は今、庭で走り回りながら飼い主の声を聞いています。", "answer_en": "The dog is running around in the garden while listening to its owner now."},
    {"question_jp": "私は今、書斎で本を読みながらコーヒーを飲み、考え事をしています。", "answer_en": "I am reading a book in my study while drinking coffee and thinking now."},
    {"question_jp": "彼は今、リビングでゲームをしながらチャットで友達と話しています。", "answer_en": "He is playing a game in the living room while chatting with friends now."},
    {"question_jp": "私は今、音楽を聴きながら料理をして、同時にタイマーを確認しています。", "answer_en": "I am listening to music while cooking and simultaneously checking the timer now."},
    {"question_jp": "彼女は今、庭で植物に水をやりながら日記を書いています。", "answer_en": "She is watering the plants in the garden while writing in her diary now."}
  ]
    }
  ]
}
